src/Documents/МотивацияЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МотивацияЗП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДанныеПоАмортизацииАвтомобилей</xr:Item>
				<xr:Item>InformationRegister.СуммыПоСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтредактирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>(Общ) Любая дополнительная информация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочиеДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоОкладу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПремии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бонус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаПроезд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаПочту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПереработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПереработкиЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниПереработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПереработкиДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПремияПр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Больничный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпускные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОФ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоплатаОФ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТелефонСверхНормы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоАкты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПНАкты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрочиеУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдержанияЗаКПК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штраф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыдаче</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыдачеЗаМинусомАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ДанныеПоАмортизацииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоАмортизацииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СуммыПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СуммыПоСотрудникам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РублиЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/МотивацияЗП/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДанныеПоАмортизацииАвтомобилей
	Движения.ДанныеПоАмортизацииАвтомобилей.Записывать = Истина;
	Движения.ДанныеПоАмортизацииАвтомобилей.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Если ТекСтрокаРаботникиОрганизации.НачисленоАкты <> 0 или ТекСтрокаРаботникиОрганизации.ПНАкты <> 0 или ТекСтрокаРаботникиОрганизации.Акты <> 0 Тогда 
			Движение = Движения.ДанныеПоАмортизацииАвтомобилей.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сотрудник = ТекСтрокаРаботникиОрганизации.Сотрудник;
			Движение.СуммаНачисления = ТекСтрокаРаботникиОрганизации.НачисленоАкты;
			Движение.ПН = ТекСтрокаРаботникиОрганизации.ПНАкты;
			Движение.СуммаВыплаты = ТекСтрокаРаботникиОрганизации.Акты;
		КонецЕсли;
	КонецЦикла;

	// регистр СуммыПоСотрудникам
	Движения.СуммыПоСотрудникам.Записывать = Истина;
	Движения.СуммыПоСотрудникам.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Если ТекСтрокаРаботникиОрганизации.КВыдаче+ТекСтрокаРаботникиОрганизации.ТелефонСверхНормы > 0 Тогда 
			Движение = Движения.СуммыПоСотрудникам.Добавить();
			Движение.Период = НачалоМесяца(Дата); //О.Т. Аверсон 10.01.2018 № 1424
			Движение.Организация = Организация;
			Движение.Сотрудник = ТекСтрокаРаботникиОрганизации.Сотрудник;
			Движение.ФизЛицо = ТекСтрокаРаботникиОрганизации.ФизЛицо;
			Движение.РублиЧ = ТекСтрокаРаботникиОрганизации.КВыдаче+ТекСтрокаРаботникиОрганизации.ТелефонСверхНормы; //О.Т. Аверсон 10.01.2018 № 1424
		КонецЕсли;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("Макет",	"Печать К выдаче без аванса");	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура Печать(Имя) Экспорт
	
	ТабДок = ПечатьМакета(Имя);  	
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(); 	
	
КонецПроцедуры

Функция ПечатьМакета(Имя,ТекФизЛицо = Неопределено,ТекПодразделение = Неопределено) экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.МотивацияЗП.ПолучитьМакет("Макет");
	// Заголовок
	ОбластьПустая = Макет.ПолучитьОбласть("ПустаяСтрока|Раздел1");
	ТабДок.Вывести(ОбластьПустая);
	
	ОбластьШ1 = Макет.ПолучитьОбласть("Шапка|Раздел1");
	ОбластьШ2 = Макет.ПолучитьОбласть("Шапка|Раздел2");
	
	ОбластьС1 = Макет.ПолучитьОбласть("Строка|Раздел1");
	ОбластьС2 = Макет.ПолучитьОбласть("Строка|Раздел2");
	
	ОбластьИШ1 = Макет.ПолучитьОбласть("ИтогШапка|Раздел1");
	ОбластьИШ2 = Макет.ПолучитьОбласть("ИтогШапка|Раздел2");
	
	ОбластьИС1 = Макет.ПолучитьОбласть("ИтогСтрока|Раздел1");
	ОбластьИС2 = Макет.ПолучитьОбласть("ИтогСтрока|Раздел2");
	
	ТЗНачисления = Новый ТаблицаЗначений;
	ТЗНачисления.Колонки.Добавить("Начисления");
	ТЗНачисления.Колонки.Добавить("Сумма");
	
	ТЗНачисления1 = Новый ТаблицаЗначений;
	//ТЗНачисления1.Колонки.Добавить("Начисления");
	ТЗНачисления1.Колонки.Добавить("Сумма");
	Для Каждого Стр из РаботникиОрганизации Цикл 
		ПоТекущемуСотр = Ложь;
		Если ЗначениеЗаполнено(ТекФизЛицо) Тогда 
			ПоТекущемуСотр = Истина;
		КонецЕсли;
		ПоТекущемуПодр = Ложь;
		Если ЗначениеЗаполнено(ТекПодразделение) Тогда 
			ПоТекущемуПодр = Истина;
			РегистрРаботники = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Дата,Новый Структура("Сотрудник",стр.Сотрудник));

		КонецЕсли;

		
		
		Если ?(ПоТекущемуСотр,Стр.ФизЛицо = ТекФизЛицо,?(ПоТекущемуПодр,РегистрРаботники.ПодразделениеОрганизации =ТекПодразделение,Истина)) Тогда 
			
			ТЗНачисления1.Очистить();
			
			ОбластьШ1.Параметры.Сотрудник = Стр.Сотрудник; 		
			ТабДок.Вывести(ОбластьШ1);
			Если Стр.РабочиеДни > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Раб.дни";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.РабочиеДни;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
					
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Раб.дни"));
				Если не МассивНач.Количество()>0 Тогда 				
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Раб.дни";
					СтрТЗНачисления.Сумма = Стр.РабочиеДни;
					
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.РабочиеДни;
					
				КонецЕсли;
			КонецЕсли;
			Если Стр.Оклад > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Оклад";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.Оклад;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Оклад"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.Оклад;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Оклад";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.СуммаПоОкладу > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Нач. за отраб.время";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.СуммаПоОкладу;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Нач. за отраб.время"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.СуммаПоОкладу;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Нач. за отраб.время";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.СуммаПремии > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Премия по МП";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.СуммаПремии;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Премия по МП"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.СуммаПремии;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Премия по МП";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.Бонус > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Бонус";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.Бонус;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Бонус"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.Бонус;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Бонус";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.Прочее > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Прочие доходы";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.Прочее;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Прочие доходы"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.Прочее;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Прочие доходы";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			КонецЕсли;
			Если Стр.Телефон > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Телефон";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.Телефон;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Телефон"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.Телефон;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Телефон";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.ЧасыПереработки > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Часы перераб.";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.ЧасыПереработки;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Часы перераб."));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.ЧасыПереработки;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Часы перераб.";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.СуммаПереработкиЧасы > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Сумма";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.СуммаПереработкиЧасы;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Сумма"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.СуммаПереработкиЧасы;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Сумма";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.ДниПереработки > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Дни перераб.";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.ДниПереработки;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Дни перераб."));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.ДниПереработки;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Дни перераб.";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.СуммаПереработкиДни > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Сумма";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.СуммаПереработкиДни;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Сумма"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.СуммаПереработкиДни;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Сумма";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			КонецЕсли;
			Если Стр.ПремияПр > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Премия";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.ПремияПр;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Премия"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.ПремияПр;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Премия";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			КонецЕсли;
			Если Стр.Больничный > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Больничный";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.Больничный;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			иначе
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Больничный"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.Больничный;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Больничный";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			КонецЕсли;
			Если Стр.ЗаПроезд > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "за проезд";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.заПроезд;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","за проезд"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.заПроезд;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "за проезд";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			КонецЕсли;
			Если Стр.ЗаПочту > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "за почту";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.ЗаПочту;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","за почту"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.ЗаПочту;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "за почту";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.Начислено > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Начислено";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.Начислено;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Начислено"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.Начислено;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Начислено";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			//Удержано
			Если Стр.Отпускные > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Выплата отпускных";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.Отпускные;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Выплата отпускных"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.Отпускные;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Выплата отпускных";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.ОФ > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "ОФ";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.ОФ;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","ОФ"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма =-Стр.ОФ;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "ОФ";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.ДоплатаОФ > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Допл ОФ";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.ДоплатаОФ;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Допл ОФ"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.ДоплатаОФ;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Допл ОФ";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.Штраф > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Штраф";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.Штраф;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Штраф"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.Штраф;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Штраф";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.ТелефонСверхНормы > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Телеф. разг. сверхнормы";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.ТелефонСверхНормы;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Телеф. разг. сверхнормы"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.ТелефонСверхНормы;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Телеф. разг. сверхнормы";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.Акты > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Акты (транспорт)";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.Акты;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Акты (транспорт)"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.Акты;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Акты (транспорт)";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.ПрочиеУдержания > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Прочие";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.ПрочиеУдержания;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Прочие"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.ПрочиеУдержания;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Прочие";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.УдержанияЗаКПК > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Удержание за КПК";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.УдержанияЗаКПК;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Удержание за КПК"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.УдержанияЗаКПК;
					;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Удержание за КПК";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.КВыдаче > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "К выдаче";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.КВыдаче;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","К выдаче"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.КВыдаче;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "К выдаче";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.Аванс > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "Аванс";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = -Стр.Аванс;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","Аванс"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = -Стр.Аванс;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "Аванс";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			Если Стр.КВыдачеЗаМинусомАванса > 0 Тогда 
				ОбластьШ2.Параметры.Наименование = "К выдаче за минусом аванса";
				ТабДок.Присоединить(ОбластьШ2);
				СтрТЗНачисления1 = ТЗНачисления1.Добавить();
				СтрТЗНачисления1.Сумма = Стр.КВыдачеЗаМинусомАванса;
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления",ОбластьШ2.Параметры.Наименование));
				Если МассивНач.Количество()>0 Тогда 
					МассивНач[0].Сумма = МассивНач[0].Сумма + СтрТЗНачисления1.Сумма;
				иначе
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = ОбластьШ2.Параметры.Наименование;
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
			Иначе 
				МассивНач = ТЗНачисления.НайтиСтроки(Новый Структура("Начисления","К выдаче за минусом аванса"));
				Если не МассивНач.Количество()>0 Тогда 
					СтрТЗНачисления1 = ТЗНачисления1.Добавить();
					СтрТЗНачисления1.Сумма = Стр.КВыдачеЗаМинусомАванса;
					
					СтрТЗНачисления = ТЗНачисления.Добавить();
					СтрТЗНачисления.Начисления = "К выдаче за минусом аванса";
					СтрТЗНачисления.Сумма = СтрТЗНачисления1.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			ОбластьС1.Параметры.Комментарий = Стр.Комментарий;
			ОбластьС1.Параметры.Должность = Стр.Должность;
			ТабДок.Вывести(ОбластьС1);
			Для Каждого СтрНач из ТЗНачисления1 Цикл
				Если СтрНач.Сумма<>0 Тогда 
					ОбластьС2.Параметры.НаименованиеСумма = СтрНач.Сумма;
					ТабДок.Присоединить(ОбластьС2);  	
				КонецЕсли;
			КонецЦикла;
			
			
			
		КонецЕсли;
		
	КонецЦикла;
	ТабДок.Вывести(ОбластьИШ1);
	Для Каждого СтрНач из ТЗНачисления Цикл
		Если СтрНач.Сумма<>0 Тогда
			ОбластьИШ2.Параметры.Наименование = СтрНач.Начисления;
			ТабДок.Присоединить(ОбластьИШ2);  	
		КонецЕсли;
	КонецЦикла;
	ТабДок.Вывести(ОбластьИС1);
	Для Каждого СтрНач из ТЗНачисления Цикл
		Если СтрНач.Сумма<>0 Тогда
			ОбластьИС2.Параметры.НаименованиеСумма = СтрНач.Сумма;
			ТабДок.Присоединить(ОбластьИС2);  
		КонецЕсли;
	КонецЦикла;
	Возврат ТабДок;
	
КонецФункции
